# **Pandas Tutorial** <a id="0"></a>
<hr>
1. [Overview](#1)
2. [Pandas Library About](#2)
3. [Import Library](#3)
4. [Pandas Data Structure](#4)
    * [Series](#5)
    * [DataFrame](#6)
5. [Import Data](#7)
    * [CSV](#8)
    * [Excel](#9)
    * [Others(json, SQL, html)](#10)
6. [Exporting Data](#11)
7. [Create Test Objects](#12)
8. [Summariza Data](#13)
    * [df.info()](#14)
    * [df.shape()](#15)
    * [df.index](#16)
    * [df.columns](#17)
    * [df.count()](#18)
    * [df.sum()](#19)
    * [df.cumsum()](#20)
    * [df.min()](#21)
    * [df.max()](#22)
    * [idxmin()](#23)
    * [idxmax()](#24)
    * [df.describe()](#25)
    * [df.mean()](#26)
    * [df.median()](#27)
    * [df.quantile([0.25,0.75])](#28)
    * [df.var()](#29)
    * [df.std()](#30)
    * [df.cummax()](#31)
    * [df.cummin()](#32)
    * [df['columnName'].cumproad()](#33)
    * [len(df)](#34)
    * [df.isnull()](#35)
    * [df.corr()](#81)
9. [Pandas with Selection & Filtering](#36)
    * [series['index']](#37)
    * [df[n:n]](#38)
    * [df.iloc[[0],[5]]](#39)
    * [df.loc[n:n]](#40)
    * [df['columnName']](#41)
    * [df['columnName][n]](#42)
    * [df['columnName'].nunique()](#43)
    * [df['columnName'].unique()](#44)
    * [df.columnName](#45)
    * [df['columnName'].value_counts(dropna =False)](#46)
    * [df.head(n)](#47)
    * [df.tail(n)](#48)
    * [df.sample(n)](#49)
    * [df.sample(frac=0.5)](#50)
    * [df.nlargest(n,'columnName')](#51)
    * [df.nsmallest(n,'columnName')](#52)
    * [df[df.columnName < n]](#53)
    * [df[['columnName','columnName']] ](#54)
    * [df.loc[:,"columnName1":"columnName2"]](#55)
    * [Create Filter](#56)
    * [df.filter(regex = 'code')](#57)
    * [np.logical_and](#58)
    * [Filtering with &](#59)
10. [Sort Data](#60)
    * [df.sort_values('columnName')](#61)
    * [df.sort_values('columnName', ascending=False)](#62)
    * [df.sort_index()](#63)
11. [Rename & Defining New & Change Columns](#64)
    * [df.rename(columns= {'columnName' : 'newColumnName'})](#65)
    * [Defining New Column](#66)
    * [Change Index Name](#67)
    * [Make all columns lowercase](#68)
    * [Make all columns uppercase](#69)
12. [Drop Data](#70)
    * [df.drop(columns=['columnName'])](#71)
    * [Series.drop(['index'])](#72)
    * [Drop an observation (row)](#82)
    * [Drop a variable (column)](#83)
13. [Convert Data Types](#73)
    * [df.dtypes](#74)
    * [df['columnName'] = df['columnName'].astype('dataType')](#75)
    * [pd.melt(frame=dataFrameName,id_vars = 'columnName', value_vars= ['columnName'])](#76)
14. [Apply Function](#77)
    * [Method 1](#78)
    * [Method 2](#79)
15. [Utilities Code](#80)

# **Overview** <a id="1"></a>
<mark>[Return Contents](#0)
<hr>

Welcome to my Kernel! In this kernel, I show you Pandas functions and how to use pandas. Why do I this? Because everyone who's just starting out or who's a professional is using the pandas.

If you have a question or feedback, do not hesitate to write and if you **like** this kernel, please do not forget to **UPVOTE**.

# **What is the pandas?** <a id="2"></a>
<mark>[Return Contents](#0)
<hr>

pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

pandas is a NumFOCUS sponsored project. This will help ensure the success of development of pandas as a world-class open-source project, and makes it possible to donate to the project.

# **Import Library** <a id="3"></a>
<mark>[Return Contents](#0)
<hr>

In [2]:
import numpy as np # linear algebra
import pandas as pd # import in pandas

import os
print(os.listdir("./input"))

['combinedNewsExcel.xlsx', 'Combined_News_DJIA.csv', 'RedditNews.csv', 'RedditNewsExcel.xlsx', 'upload_DJIA_table.csv']

# **Pandas Data Structure** <a id="4"></a>
<mark>[Return Contents](#0)
<hr>

Pandas has two types of data structures. These are series and dataframe.

### **Series** <a id="5"></a>

The series is a one-dimensional labeled array. It can accommodate any type of data in it.

In [3]:
mySeries = pd.Series([3,-5,7,4], index=['a','b','c','d'])
type(mySeries)

pandas.core.series.Series

### **DataFrame** <a id="6"></a>

The dataframe is a two-dimensional data structure. It contains columns.

In [4]:
data = {'Country' : ['Belgium', 'India', 'Brazil' ],
        'Capital': ['Brussels', 'New Delhi', 'Brassilia'],
        'Population': [1234,1234,1234]}
datas = pd.DataFrame(data, columns=['Country','Capital','Population'])
print(type(data))
print(type(datas))

print(data)
datas

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>
{'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brassilia'], 'Population': [1234, 1234, 1234]}

   Country    Capital  Population
0  Belgium   Brussels        1234
1    India  New Delhi        1234
2   Brazil  Brassilia        1234

# **Import Library** <a id="7"></a>
<mark>[Return Contents](#0)
<hr>

With pandas, we can open CSV, Excel and SQL databases. I will show you how to use this method for CSV and Excel files only.

### **CSV(comma - separated values)** <a id="8"></a>

It is very easy to open and read CSV files and to overwrite the CSV file.

In [5]:
df_combined_news = pd.read_csv('./input/Combined_News_DJIA.csv')
type(df_combined_news)
# If your Python file is not in the same folder as your CSV file, you should do this as follows.
# df = pd.read_csv('/home/desktop/Iris.csv')

pandas.core.frame.DataFrame

### **Excel** <a id="9"></a>

When we want to work with Excel files, we need to type the following code.

In [6]:
# pd.read_excel('filename')
# pd.to_excel('dir/dataFrame.xlsx', sheet_name='Sheet1')

pd.read_excel('./input/RedditNewsExcel.xlsx')

             Date                                               News
0      2016-07-01  A 117-year-old woman in Mexico City finally re...
1      2016-07-01   IMF chief backs Athens as permanent Olympic host
2      2016-07-01  The president of France says if Brexit won, so...
3      2016-07-01  British Man Who Must Give Police 24 Hours' Not...
4      2016-07-01  100+ Nobel laureates urge Greenpeace to stop o...
5      2016-07-01  Brazil: Huge spike in number of police killing...
6      2016-07-01  Austria's highest court annuls presidential el...
7      2016-07-01  Facebook wins privacy case, can track any Belg...
8      2016-07-01  Switzerland denies Muslim girls citizenship af...
9      2016-07-01  China kills millions of innocent meditators fo...
10     2016-07-01  France Cracks Down on Factory Farms - A viral ...
11     2016-07-01  Abbas PLO Faction Calls Killer of 13-Year-Old ...
12     2016-07-01  Taiwanese warship accidentally fires missile t...
13     2016-07-01  Iran celebrates American Human Rights Week, mo...
14     2016-07-01  U.N. panel moves to curb bias against L.G.B.T....
15     2016-07-01  The United States has placed Myanmar, Uzbekist...
16     2016-07-01  S&amp;P revises European Union credit rating t...
17     2016-07-01  India gets $1 billion loan from World Bank for...
18     2016-07-01  U.S. sailors detained by Iran spoke too much u...
19     2016-07-01  Mass fish kill in Vietnam solved as Taiwan ste...
20     2016-07-01  Philippines president Rodrigo Duterte urges pe...
21     2016-07-01  Spain arrests three Pakistanis accused of prom...
22     2016-07-01  Venezuela, where anger over food shortages is ...
23     2016-07-01  A Hindu temple worker has been killed by three...
24     2016-07-01  Ozone layer hole seems to be healing - US &amp...
25     2016-06-30  Jamaica proposes marijuana dispensers for tour...
26     2016-06-30  Stephen Hawking says pollution and 'stupidity'...
27     2016-06-30  Boris Johnson says he will not run for Tory pa...
28     2016-06-30  Six gay men in Ivory Coast were abused and for...
29     2016-06-30  Switzerland denies citizenship to Muslim immig...
...           ...                                                ...
76570  2008-06-09  b'Future of the United States of Europe in the...
76571  2008-06-09  b"'Military coup' in Zimbabwe as Mugabe is for...
76572  2008-06-09  b'Rising Oil Prices Spark Strikes in Spain and...
76573  2008-06-09  b'Chvez to FARC: Asks to end armed strugle, "T...
76574  2008-06-09       b'Fliers in for pain as airlines pack it in'
76575  2008-06-08  b'Nim Chimpsky: The tragedy of the chimp who t...
76576  2008-06-08  b"Canada: Beware slippery slope' to censorship...
76577  2008-06-08  b'EU Vice-President Luisa Morgantini and the I...
76578  2008-06-08  b"Israeli minister: Israel will attack Iran if...
76579  2008-06-08  b'Albino Killings in Tanzania. At least 19 alb...
76580  2008-06-08  b'Chiapas: army occupies Zapatista communities...
76581  2008-06-08  b'Polar bear swims 200 miles, is shot dead upo...
76582  2008-06-08  b'News is a contraband item in Pakistan now, a...
76583  2008-06-08  b'Albinos, Long Shunned, Face Threat in Tanzan...
76584  2008-06-08  b'Town in Britain Plans to Start its Own Curre...
76585  2008-06-08       b'BBC reporter among 16 dead in Afghanistan'
76586  2008-06-08  b'Lebanese women still vulnerable to violence:...
76587  2008-06-08  b'Police release chilling images of man left f...
76588  2008-06-08  b"Iceland opens Europe's largest national park...
76589  2008-06-08  b'Citizens fighting Blackwater Potrero. Was th...
76590  2008-06-08  b"S. Korean protesters, police clash in beef r...
76591  2008-06-08  b"Oil reserves 'will last decades' - a BBC Sco...
76592  2008-06-08  b'Cameras designed to detect terrorist facial ...
76593  2008-06-08  b'Israeli peace activists protest 41 years of ...
76594  2008-06-08  b"A 5.1 earthquake hits China's Southern Qingh...
76595  2008-06-08  b'Man goes berzerk in Akihabara and stabs ever...
76596  2008-06-08  b'Threat of world AIDS pandemic among heterose...
76597  2008-06-08  b'Angst in Ankara: Turkey Steers into a Danger...
76598  2008-06-08  b"UK: Identity cards 'could be used to spy on ...
76599  2008-06-08  b'Marriage, they said, was reduced to the stat...

[76600 rows x 2 columns]

### **Others(json, SQL, table, html)** <a id="10"></a>

In [ ]:
# pd.read_sql(query,connection_object) -> Reads from a SQL table/database
# pd.read_table(filename) -> From a delimited text file(like TSV)
# pd.read_json(json_string) -> Reads from a json formatted string, URL or file
# pd.read_html(url) -> Parses an html URL, string or file and extracts tables to a list of dataframes
# pd.read_clipboard() -> Takes the contentes of your clipboard and passes it to read_table()
# pd.DataFrame(dict) -> From a dict, keys for columns names, values for data as lists

# **Exporting Data** <a id="11"></a>
<mark>[Return Contents](#0)
<hr>

In [29]:
# df.to_csv(filename) -> Writes to a CSV file
# df.to_excel(filename) -> Writes on an Excel file
# df.to_sql(table_name, connection_object) -> Writes to a SQL table
# df.to_json(filename) -> Writes to a file in JSON format
# df.to_html(filename) -> Saves as an HTML table
# df.to_clipboard() -> Writes to the clipboard

df_combined_news.to_excel('./input/combinedNewsExcel.xlsx')
print('ok')

ok

# **Create Test Objects** <a id="12"></a>
<mark>[Return Contents](#0)
<hr>

In [8]:
df = pd.DataFrame(np.random.rand(20,5)) # 5 columns and 20 rows of random floats
df

           0         1         2         3         4
0   0.903277  0.249365  0.292620  0.841302  0.839731
1   0.483048  0.939915  0.306765  0.047191  0.404030
2   0.153219  0.325504  0.420761  0.283851  0.855962
3   0.274764  0.924069  0.369449  0.007781  0.709699
4   0.696609  0.790521  0.549056  0.227988  0.765110
5   0.894192  0.380425  0.169271  0.772660  0.846253
6   0.191670  0.994958  0.418455  0.453797  0.792212
7   0.372298  0.292011  0.673528  0.306446  0.046855
8   0.612927  0.749032  0.084790  0.122511  0.620499
9   0.923076  0.103213  0.634171  0.057230  0.617223
10  0.986693  0.719827  0.842982  0.321114  0.472636
11  0.738094  0.799398  0.831245  0.235559  0.222352
12  0.387476  0.750464  0.934208  0.721894  0.405898
13  0.622197  0.332024  0.710150  0.418964  0.067266
14  0.228232  0.743586  0.927934  0.339898  0.281057
15  0.915866  0.693298  0.738005  0.433678  0.764229
16  0.362988  0.154960  0.376215  0.879101  0.688818
17  0.054443  0.669508  0.388316  0.407757  0.357887
18  0.504569  0.475040  0.336973  0.351332  0.324727
19  0.069738  0.833832  0.817695  0.296957  0.234585

# **Summarize Data** <a id="13"></a>
<mark>[Return Contents](#0)
<hr>

It's easy to get information about data with pandas. It makes it easier for us. Let's examine the existing functions one by one

### **df.info()** <a id="14"></a>
This Code provides detailed information about our data.

* **RangeIndex:** Specifies how many data there is.
* **Data Columns:** Specifies how many columns are found.
* **Columns:** Gives information about Columns.
* **dtypes:** It says what kind of data you have and how many of these data you have.
* **Memory Usage:** It says how much memory usage is.

<mark>[Return Contents](#0)
<hr>

In [42]:
df2 = pd.read_csv('./input/RedditNews.csv')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73608 entries, 0 to 73607
Data columns (total 2 columns):
Date    73608 non-null object
News    73608 non-null object
dtypes: object(2)
memory usage: 1.1+ MB

### **df.shape()** <a id="15"></a>
This code shows us the number of rows and columns.

<mark>[Return Contents](#0)
<hr>

In [9]:
df.shape

(20, 5)

### **df.index** <a id="16"></a>
This code shows the total number of index found.

<mark>[Return Contents](#0)
<hr>

In [10]:
df.index

RangeIndex(start=0, stop=20, step=1)

### **df.columns** <a id="17"></a>
This code shows all the columns contained in the data we have examined.

<mark>[Return Contents](#0)
<hr>

In [11]:
df.columns

RangeIndex(start=0, stop=5, step=1)

### **df.count()** <a id="18"></a>
This code shows us how many pieces of data are in each column.

<mark>[Return Contents](#0)
<hr>

In [12]:
df.count()

0    20
1    20
2    20
3    20
4    20
dtype: int64

### **df.sum()** <a id="19"></a>
This code shows us the sum of the data in each column.

<mark>[Return Contents](#0)
<hr>

In [13]:
df.sum()

0    10.375375
1    11.920951
2    10.822592
3     7.527012
4    10.317029
dtype: float64

### **df.cumsum()** <a id="20"></a>
This code gives us cumulative sum of the data.

<mark>[Return Contents](#0)
<hr>

In [17]:
df.cumsum().head()

          0         1         2         3         4
0  0.903277  0.249365  0.292620  0.841302  0.839731
1  1.386325  1.189280  0.599385  0.888493  1.243761
2  1.539544  1.514784  1.020146  1.172344  2.099723
3  1.814308  2.438853  1.389595  1.180125  2.809422
4  2.510917  3.229374  1.938652  1.408113  3.574531

### **df.min()** <a id="21"></a>
This code brings us the smallest of the data.

<mark>[Return Contents](#0)
<hr>

In [18]:
df.min()

0    0.054443
1    0.103213
2    0.084790
3    0.007781
4    0.046855
dtype: float64

### **df.max()** <a id="22"></a>
This code brings up the largest among the data.

<mark>[Return Contents](#0)
<hr>

In [19]:
df.max()

0    0.986693
1    0.994958
2    0.934208
3    0.879101
4    0.855962
dtype: float64

### **idxmin()**  <a id="23"></a>
This code fetches the smallest value in the data. The use on series and dataframe is different.

<mark>[Return Contents](#0)
<hr>

In [51]:
print("df: ",df['0'].idxmin())
print("series", mySeries.idxmin())

KeyError: '0'

### **idxmax()**  <a id="24"></a>
This code returns the largest value in the data.

<mark>[Return Contents](#0)
<hr>

In [50]:
print("df: ",df['0'].idxmax())
print("series: ",mySeries.idxmax())

KeyError: '0'

### **df.describe()**  <a id="25"></a>
This Code provides basic statistical information about the data. The numerical column is based.

* **count:** vnumber of entries
* **mean: **average of entries
* **std:** standart deviation
* **min:** minimum entry
* **25%:** first quantile
* **50%:** median or second quantile
* **75%:** third quantile
* **max:** maximum entry

<mark>[Return Contents](#0)
<hr>

In [24]:
df.describe()

               0          1          2          3          4
count  20.000000  20.000000  20.000000  20.000000  20.000000
mean    0.518769   0.596048   0.541130   0.376351   0.515851
std     0.307316   0.278529   0.257919   0.254903   0.266376
min     0.054443   0.103213   0.084790   0.007781   0.046855
25%     0.263131   0.330394   0.361330   0.233666   0.313809
50%     0.493809   0.706563   0.484909   0.330506   0.544930
75%     0.777118   0.792740   0.757928   0.438708   0.764449
max     0.986693   0.994958   0.934208   0.879101   0.855962

### **df.mean()**  <a id="26"></a>
This code returns the mean value for the numeric column.

<mark>[Return Contents](#0)
<hr>

In [25]:
df.mean()

0    0.518769
1    0.596048
2    0.541130
3    0.376351
4    0.515851
dtype: float64

### **df.median()**  <a id="27"></a>
This code returns median for columns with numeric values.

<mark>[Return Contents](#0)
<hr>

In [26]:
df.median()

0    0.493809
1    0.706563
2    0.484909
3    0.330506
4    0.544930
dtype: float64

### **df.quantile([0.25,0.75])**  <a id="28"></a>
This code calculates the values 0.25 and 0.75 of the columns for each column.

<mark>[Return Contents](#0)
<hr>

In [27]:
df.quantile([0.25,0.75])

             0         1         2         3         4
0.25  0.263131  0.330394  0.361330  0.233666  0.313809
0.75  0.777118  0.792740  0.757928  0.438708  0.764449

### **df.var()**  <a id="29"></a>
This code calculates the variance value for each column with a numeric value.

<mark>[Return Contents](#0)
<hr>

In [28]:
df.var()

0    0.094443
1    0.077578
2    0.066522
3    0.064975
4    0.070956
dtype: float64

### **df.std()** <a id="30"></a>
This code calculates the standard deviation value for each column with numeric value.
Ecart type
<mark>[Return Contents](#0)
<hr>

In [29]:
df.std()

0    0.307316
1    0.278529
2    0.257919
3    0.254903
4    0.266376
dtype: float64

### **df.cummax()** <a id="31"></a>
This code calculates the cumulative max value between the data.

<mark>[Return Contents](#0)
<hr>

In [38]:
df.cummax()

           0         1         2         3         4
0   0.903277  0.249365  0.292620  0.841302  0.839731
1   0.903277  0.939915  0.306765  0.841302  0.839731
2   0.903277  0.939915  0.420761  0.841302  0.855962
3   0.903277  0.939915  0.420761  0.841302  0.855962
4   0.903277  0.939915  0.549056  0.841302  0.855962
5   0.903277  0.939915  0.549056  0.841302  0.855962
6   0.903277  0.994958  0.549056  0.841302  0.855962
7   0.903277  0.994958  0.673528  0.841302  0.855962
8   0.903277  0.994958  0.673528  0.841302  0.855962
9   0.923076  0.994958  0.673528  0.841302  0.855962
10  0.986693  0.994958  0.842982  0.841302  0.855962
11  0.986693  0.994958  0.842982  0.841302  0.855962
12  0.986693  0.994958  0.934208  0.841302  0.855962
13  0.986693  0.994958  0.934208  0.841302  0.855962
14  0.986693  0.994958  0.934208  0.841302  0.855962
15  0.986693  0.994958  0.934208  0.841302  0.855962
16  0.986693  0.994958  0.934208  0.879101  0.855962
17  0.986693  0.994958  0.934208  0.879101  0.855962
18  0.986693  0.994958  0.934208  0.879101  0.855962
19  0.986693  0.994958  0.934208  0.879101  0.855962

### **df.cummin()** <a id="32"></a>
This code returns the cumulative min value of the data.

<mark>[Return Contents](#0)
<hr>

In [35]:
df.cummin()

           0         1         2         3         4
0   0.903277  0.249365  0.292620  0.841302  0.839731
1   0.483048  0.249365  0.292620  0.047191  0.404030
2   0.153219  0.249365  0.292620  0.047191  0.404030
3   0.153219  0.249365  0.292620  0.007781  0.404030
4   0.153219  0.249365  0.292620  0.007781  0.404030
5   0.153219  0.249365  0.169271  0.007781  0.404030
6   0.153219  0.249365  0.169271  0.007781  0.404030
7   0.153219  0.249365  0.169271  0.007781  0.046855
8   0.153219  0.249365  0.084790  0.007781  0.046855
9   0.153219  0.103213  0.084790  0.007781  0.046855
10  0.153219  0.103213  0.084790  0.007781  0.046855
11  0.153219  0.103213  0.084790  0.007781  0.046855
12  0.153219  0.103213  0.084790  0.007781  0.046855
13  0.153219  0.103213  0.084790  0.007781  0.046855
14  0.153219  0.103213  0.084790  0.007781  0.046855
15  0.153219  0.103213  0.084790  0.007781  0.046855
16  0.153219  0.103213  0.084790  0.007781  0.046855
17  0.054443  0.103213  0.084790  0.007781  0.046855
18  0.054443  0.103213  0.084790  0.007781  0.046855
19  0.054443  0.103213  0.084790  0.007781  0.046855

### **df['columnName'].cumproad()** <a id="33"></a>
This code returns the cumulative production of the data.

<mark>[Return Contents](#0)
<hr>

In [56]:
df_table = pd.read_csv('./input/upload_DJIA_table.csv')
df_table['Open'].cumprod().head()

0    1.792424e+04
1    3.174878e+08
2    5.542073e+12
3    9.527105e+16
4    1.653449e+21
Name: Open, dtype: float64

### **len(df)** <a id="34"></a>
This code gives you how many data there is.

<mark>[Return Contents](#0)
<hr>

In [58]:
len(df_table)

1989

### **df.isnull()** <a id="35"></a>
Checks for null values, returns boolean.

<mark>[Return Contents](#0)
<hr>

In [59]:
df.isnull().head()

       0      1      2      3      4
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False

### **df.corr()** <a id="81"></a>
it gives information about the correlation between the data.

<mark>[Return Contents](#0)
<hr>

In [60]:
df.corr()

          0         1         2         3         4
0  1.000000 -0.285092 -0.008100  0.099058  0.244387
1 -0.285092  1.000000  0.146022 -0.402114 -0.062963
2 -0.008100  0.146022  1.000000 -0.053648 -0.525534
3  0.099058 -0.402114 -0.053648  1.000000  0.226519
4  0.244387 -0.062963 -0.525534  0.226519  1.000000

# **Selection & Filtering** <a id="36"></a>
<mark>[Return Contents](#0)
<hr>

This is how we can choose the data we want with pandas, how we can bring unique data.

### **mySeries['b']** <a id="37"></a>
This code returns data with a value of B in series.

<mark>[Return Contents](#0)
<hr>

In [61]:
mySeries['b']

-5

### **df[n:n]** <a id="38"></a>
This code fetches data from N to N.

<mark>[Return Contents](#0)
<hr>

In [62]:
df[1982:]
#Or
#df[5:7]

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

### **df.iloc[[n],[n]]** <a id="39"></a>
This code brings the data in the N row and N column in the DataFrame.

<mark>[Return Contents](#0)
<hr>

In [63]:
df.iloc[[0],[3]]

          3
0  0.841302

### **df.loc[n:n]** <a id="40"></a>
This code allows us to fetch the data in the range we specify.

<mark>[Return Contents](#0)
<hr>

In [64]:
#df.loc[n:]
# OR
df.loc[5:7]

          0         1         2         3         4
5  0.894192  0.380425  0.169271  0.772660  0.846253
6  0.191670  0.994958  0.418455  0.453797  0.792212
7  0.372298  0.292011  0.673528  0.306446  0.046855

### **df['columnName']** <a id="41"></a>
With this code, we can select and bring any column we want.

<mark>[Return Contents](#0)
<hr>

In [66]:
df_table['Open'].head()
# OR
# df.Open

0    17924.240234
1    17712.759766
2    17456.019531
3    17190.509766
4    17355.210938
Name: Open, dtype: float64

### **df['columnName'][n]** <a id="42"></a>
With this code, we can select and return any value of the column we want.

<mark>[Return Contents](#0)
<hr>

In [68]:
df_table['Open'][0]
# OR
# df.Open[0]
# df["Open"][1]
# df.loc[1,["Open"]]

17924.240234

### **df['columnName'].nunique()** <a id="43"></a>
This code shows how many of the data that is in the selected column and does not repeat.

<mark>[Return Contents](#0)
<hr>

In [73]:
len(df_table)

1989

In [69]:
df_table['Open'].nunique()

1980

### **df['columnName'].unique()** <a id="44"></a>
This code shows which of the data in the selected column repeats.

<mark>[Return Contents](#0)
<hr>

In [77]:
df_table['Open'].unique()
# We can write the above code as follows:: df.Open.unique()

array([17924.240234, 17712.759766, 17456.019531, ..., 11781.700195,
       11729.669922, 11432.089844])

### **df.columnName** <a id="45"></a>
This code is another way to select the column we want.

<mark>[Return Contents](#0)
<hr>

In [79]:
df_table.Open.head()

0    17924.240234
1    17712.759766
2    17456.019531
3    17190.509766
4    17355.210938
Name: Open, dtype: float64

### **df['columnName'].value_counts(dropna =False)** <a id="46"></a>
This code counts all of the data in the column we have specified, but does not count the null/none values.

<mark>[Return Contents](#0)
<hr>

In [80]:
print(df_table.Open.value_counts(dropna =True).head())
# OR
# print(df['Item'].value_counts(dropna =False))

17374.779297    2
18033.330078    2
10309.389648    2
17711.119141    2
17812.250000    2
Name: Open, dtype: int64

### **df.head(n)** <a id="47"></a>
This code optionally brings in the first 5 data. returns the number of data that you type instead of N.

<mark>[Return Contents](#0)
<hr>

In [81]:
df_table.head()
# OR
# df.head(15)

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

### **df.tail(n)** <a id="48"></a>
This code optionally brings 5 data at the end. returns the number of data that you type instead of N.

<mark>[Return Contents](#0)
<hr>

In [90]:
df_table.tail(10)
# OR
# df.tail(20)

,Date,Open,High,Low,Close,Volume,Adj Close
1979,2008-08-21,11415.230469,11476.209961,11315.570312,11430.209961,130020000,11430.209961
1980,2008-08-20,11345.940430,11454.150391,11290.580078,11417.429688,144880000,11417.429688
1981,2008-08-19,11478.089844,11478.169922,11318.500000,11348.549805,171580000,11348.549805
1982,2008-08-18,11659.650391,11690.429688,11434.120117,11479.389648,156290000,11479.389648
1983,2008-08-15,11611.209961,11709.889648,11599.730469,11659.900391,215040000,11659.900391
1984,2008-08-14,11532.070312,11718.280273,11450.889648,11615.929688,159790000,11615.929688
1985,2008-08-13,11632.809570,11633.780273,11453.339844,11532.959961,182550000,11532.959961
1986,2008-08-12,11781.700195,11782.349609,11601.519531,11642.469727,173590000,11642.469727
1987,2008-08-11,11729.669922,11867.110352,11675.530273,11782.349609,183190000,11782.349609
1988,2008-08-08,11432.089844,11759.959961,11388.040039,11734.320312,212830000,11734.320312

### **df.sample(n)** <a id="49"></a>
This code fetches random n data from the data.

<mark>[Return Contents](#0)
<hr>

In [92]:
df_table.sample(5)

,Date,Open,High,Low,Close,Volume,Adj Close
101,2016-02-08,16147.509766,16147.509766,15803.549805,16027.049805,165880000,16027.049805
658,2013-11-19,15974.059570,16025.849609,15943.780273,15967.030273,84570000,15967.030273
1770,2009-06-22,8538.519531,8538.830078,8334.549805,8339.009766,291240000,8339.009766
613,2014-01-27,15879.049805,15942.769531,15783.549805,15837.879883,127540000,15837.879883
102,2016-02-05,16417.949219,16423.630859,16129.809570,16204.969727,139010000,16204.969727

### **df.sample(frac=0.5)** <a id="50"></a>
This code selects the fractions of random rows and fetches the data to that extent.

<mark>[Return Contents](#0)
<hr>

In [93]:
df_table.sample(frac=0.5).head()

,Date,Open,High,Low,Close,Volume,Adj Close
917,2012-11-08,12932.809570,12980.230469,12811.240234,12811.320312,138350000,12811.320312
835,2013-03-11,14397.070312,14448.059570,14373.320312,14447.290039,94880000,14447.290039
29,2016-05-20,17437.320312,17571.750000,17437.320312,17500.939453,111990000,17500.939453
594,2014-02-24,16102.269531,16300.040039,16102.269531,16207.139648,244580000,16207.139648
1298,2011-05-05,12723.650391,12724.559570,12521.280273,12584.169922,176950000,12584.169922

### **df.nlargest(n,'columnName')** <a id="51"></a>
This code brings N from the column where we have specified the largest data.

<mark>[Return Contents](#0)
<hr>

In [94]:
df_table.nlargest(5,'Open')

,Date,Open,High,Low,Close,Volume,Adj Close
282,2015-05-20,18315.060547,18350.130859,18272.560547,18285.400391,80190000,18285.400391
283,2015-05-19,18300.480469,18351.359375,18261.349609,18312.390625,87200000,18312.390625
280,2015-05-22,18286.869141,18286.869141,18217.140625,18232.019531,78890000,18232.019531
281,2015-05-21,18285.869141,18314.890625,18249.900391,18285.740234,84270000,18285.740234
337,2015-03-03,18281.949219,18281.949219,18136.880859,18203.369141,83830000,18203.369141

### **df.nsmallest(n,'columnName')** <a id="52"></a>
This code brings N from the column where we have specified the smallest data.

<mark>[Return Contents](#0)
<hr>

In [95]:
df_table.nsmallest(3,'Open')

,Date,Open,High,Low,Close,Volume,Adj Close
1842,2009-03-10,6547.009766,6926.490234,6546.609863,6926.490234,640020000,6926.490234
1844,2009-03-06,6595.160156,6755.169922,6469.950195,6626.939941,425170000,6626.939941
1843,2009-03-09,6625.740234,6709.609863,6516.859863,6547.049805,365990000,6547.049805

### **df[df.columnName < 5]** <a id="53"></a>
This code returns the column name we have specified, which is less than 5.

<mark>[Return Contents](#0)
<hr>

In [96]:
df_table[df_table.Open > 18281.949219]

,Date,Open,High,Low,Close,Volume,Adj Close
280,2015-05-22,18286.869141,18286.869141,18217.140625,18232.019531,78890000,18232.019531
281,2015-05-21,18285.869141,18314.890625,18249.900391,18285.740234,84270000,18285.740234
282,2015-05-20,18315.060547,18350.130859,18272.560547,18285.400391,80190000,18285.400391
283,2015-05-19,18300.480469,18351.359375,18261.349609,18312.390625,87200000,18312.390625

### **df[['columnName','columnName']]** <a id="54"></a>
This code helps us pick and bring any columns we want.

<mark>[Return Contents](#0)
<hr>

In [97]:
df_table[['High','Low']].head()
# df.loc[:,["High","Low"]]

           High           Low
0  18002.380859  17916.910156
1  17930.609375  17711.800781
2  17704.509766  17456.019531
3  17409.720703  17190.509766
4  17355.210938  17063.080078

### **df.loc[:,"columnName1":"columnName2"]** <a id="55"></a>
This code returns columns from columnname1 to columnname2.

<mark>[Return Contents](#0)
<hr>

In [102]:
df_table.loc[2:3,"Date":"Close"].head()
# OR
# data.loc[:3,"Date":"Close"]

         Date          Open          High           Low         Close
2  2016-06-29  17456.019531  17704.509766  17456.019531  17694.679688
3  2016-06-28  17190.509766  17409.720703  17190.509766  17409.720703

### **Create Filter** <a id="56"></a>
<mark>[Return Contents](#0)
<hr>

In [103]:
filters = df_table.Date > '2016-06-27'
df_table[filters]

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703

### **df.filter(regex = 'code')** <a id="57"></a>
This code allows regex to filter any data we want.

<mark>[Return Contents](#0)
<hr>

In [104]:
df_table.filter(regex='^L').head()

            Low
0  17916.910156
1  17711.800781
2  17456.019531
3  17190.509766
4  17063.080078

### **np.logical_and** <a id="58"></a>
Filtering with logical_and. Lets look at the example.

<mark>[Return Contents](#0)
<hr>

In [106]:
df_table[np.logical_and(df_table['Open']>18281.949219, df_table['Date']>'2015-05-20' )]

,Date,Open,High,Low,Close,Volume,Adj Close
280,2015-05-22,18286.869141,18286.869141,18217.140625,18232.019531,78890000,18232.019531
281,2015-05-21,18285.869141,18314.890625,18249.900391,18285.740234,84270000,18285.740234

### **Filtering with &** <a id="59"></a>
<mark>[Return Contents](#0)
<hr>

In [107]:
df_table[(df_table['Open']>18281.949219) & (df_table['Date']>'2015-05-20')]

,Date,Open,High,Low,Close,Volume,Adj Close
280,2015-05-22,18286.869141,18286.869141,18217.140625,18232.019531,78890000,18232.019531
281,2015-05-21,18285.869141,18314.890625,18249.900391,18285.740234,84270000,18285.740234

# **Sort Data** <a id="60"></a>

<mark>[Return Contents](#0)
<hr>

### **df.sort_values('columnName')** <a id="61"></a>
This code sorts the column we specify in the form of low to high.

In [108]:
df_table.sort_values('Open').head()

,Date,Open,High,Low,Close,Volume,Adj Close
1842,2009-03-10,6547.009766,6926.490234,6546.609863,6926.490234,640020000,6926.490234
1844,2009-03-06,6595.160156,6755.169922,6469.950195,6626.939941,425170000,6626.939941
1843,2009-03-09,6625.740234,6709.609863,6516.859863,6547.049805,365990000,6547.049805
1846,2009-03-04,6726.500000,6979.220215,6726.419922,6875.839844,464830000,6875.839844
1847,2009-03-03,6764.810059,6855.290039,6705.629883,6726.020020,445280000,6726.020020

### **df.sort_values('columnName', ascending=False)** <a id="62"></a>
This code is the column we specify in the form of high to low.

<mark>[Return Contents](#0)
<hr>

In [109]:
df_table.sort_values('Date', ascending=False).head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

### **df.sort_index()** <a id="63"></a>
This code sorts from small to large according to the DataFrame index.

<mark>[Return Contents](#0)
<hr>

In [110]:
df_table.sort_index().head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

# **Rename & Defining New & Change Columns** <a id="64"></a>
<mark>[Return Contents](#0)
<hr>

### **df.rename(columns= {'columnName' : 'newColumnName'})** <a id="65"></a>
This code helps us change the column name. The code I wrote below changes the ID value, but as we did not assign the change to the variable DF, it seems to be unchanged as you see below.

In [111]:
df_table.rename(columns= {'Adj Close' : 'Adjclose'}).head()
# df = df.rename(columns= {'Id' : 'Identif'}, inplace=True) -> True way
# inplace= True or False; This meaning, overwrite the data set.
# Other Way
# df.columns = ['date', 'open', 'high', 'low', 'close', 'volume', 'adjclose']

,Date,Open,High,Low,Close,Volume,Adjclose
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

###  **Defining New Column** <a id="66"></a>
Create a new column

<mark>[Return Contents](#0)
<hr>

In [112]:
df_table["Difference"] = df_table.High - df_table.Low
df_table.head()

,Date,Open,High,Low,Close,Volume,Adj Close,Difference
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141,85.470703
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234,218.808594
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688,248.490235
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703,219.210937
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234,292.130860

### **Change Index Name** <a id="67"></a>
Change index name to new index name

<mark>[Return Contents](#0)
<hr>

In [113]:
print(df.index.name)
df_table.index.name = "index_name"
df_table.head()

None

,Date,Open,High,Low,Close,Volume,Adj Close,Difference
index_name,,,,,,,,
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141,85.470703
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234,218.808594
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688,248.490235
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703,219.210937
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234,292.130860

### **Make all columns lowercase** <a id="68"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
#df.columns = map(str.lower(), df.columns)

### **Make all columns uppercase** <a id="69"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
#df.columns = map(str.upper(), df.columns)

# **Drop Data** <a id="70"></a>

<mark>[Return Contents](#0)
<hr>

### **df.drop(columns=['columnName'])** <a id="71"></a>
This code deletes the column we have specified. But as above, I have to reset the delete to the df variable again.

In [ ]:
df.drop(columns=['Adj Close']).head()
# df = df.drop(columns=['Id']) -> True way
# OR
# df = df.drop('col', axis=1)
# axis = 1 is meaning delete columns
# axis = 0 is meaning delete rows

### **mySeries.drop(['a'])** <a id="72"></a>
This code allows us to delete the value specified in the series.

<mark>[Return Contents](#0)
<hr>

In [ ]:
mySeries.drop(['a'])

### **Drop an observation (row)** <a id="82"></a>

<mark>[Return Contents](#0)
<hr>

In [ ]:
# df.drop(['2016-07-01', '2016-06-27'])

### **Drop a variable (column)** <a id="83"></a>

<mark>[Return Contents](#0)
<hr>
Note: axis=1 denotes that we are referring to a column, not a row

In [ ]:
# df.drop('Volume', axis=1)

# **Convert Data Types** <a id="73"></a>

<mark>[Return Contents](#0)
<hr>

### **df.dtypes** <a id="74"></a>
This code shows what data type of columns are. Boolean, int, float, object(String), date and categorical.

In [ ]:
df.dtypes

### **df['columnName'] = df['columnName'].astype('dataType')** <a id="75"></a>
This code convert the column we specify into the data type we specify.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.Date.astype('category').dtypes
# OR Convert Datetime
# df.Date= pd.to_datetime(df.Date)

### **pd.melt(frame=dataFrameName,id_vars = 'columnName', value_vars= ['columnName'])** <a id="76"></a>
This code is confusing, so lets look at the example.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df_new = df.head()
melted = pd.melt(frame=df_new,id_vars = 'Date', value_vars= ['Low'])
melted

# **Apply Function** <a id="77"></a>

<mark>[Return Contents](#0)
<hr>

### **Method 1** <a id="78"></a>

In [ ]:
def examples(x):   #create a function
    return x*2

df.Open.apply(examples).head()  #use the function with apply()

### **Method 2** <a id="79"></a>

In [ ]:
df.Open.apply(lambda x: x*2).head()

# **Utilities Code** <a id="80"></a>

<mark>[Return Contents](#0)
<hr>

In [ ]:
# pd.get_option OR pd.set_option
# pd.reset_option("^display")

# pd.reset_option("display.max_rows")
# pd.get_option("display.max_rows")
# pd.set_option("max_r",102)                 -> specifies the maximum number of rows to display.
# pd.options.display.max_rows = 999          -> specifies the maximum number of rows to display.

# pd.get_option("display.max_columns")
# pd.options.display.max_columns = 999       -> specifies the maximum number of columns to display.

# pd.set_option('display.width', 300)

# pd.set_option('display.max_columns', 300)  -> specifies the maximum number of rows to display.
# pd.set_option('display.max_colwidth', 500) -> specifies the maximum number of columns to display. 

# pd.get_option('max_colwidth')
# pd.set_option('max_colwidth',40)
# pd.reset_option('max_colwidth')

# pd.get_option('max_info_columns')
# pd.set_option('max_info_columns', 11)
# pd.reset_option('max_info_columns')

# pd.get_option('max_info_rows')
# pd.set_option('max_info_rows', 11)
# pd.reset_option('max_info_rows')

# pd.set_option('precision',7) -> sets the output display precision in terms of decimal places. This is only a suggestion.
# OR
# pd.set_option('display.precision',3)

# pd.set_option('chop_threshold', 0) -> sets at what level pandas rounds to zero when it displays a Series of DataFrame. This setting does not change the precision at which the number is stored.
# pd.reset_option('chop_threshold')